record-collection-app/app/controllers/albums_controller.rb

    def create
        @album = Album.new(album_params)

       if @album.save
---
INSERT INTO "albums" ("title", "artist", "released", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Maggot Brain"], ["artist", "Funkadelic"], ["released", "1971"], ["created_at", "2018-05-16 19:29:58.585132"], ["updated_at", "2018-05-16 19:29:58.585132"]]